In [84]:
import math
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [149]:
tags = ['java', 'javascript', 'mysql', 'dotnet']

groups = ['Group-1', 'Group-2', 'Group-3', 'Group-4']

users = ['alice', 'john', 'kevin', 'alex']

group_tags = [
    [1, 0, 0, 0],
    [1, 1, 1, 0],
    [1, 0, 0, 0],
    [1, 0, 0, 0]
]

user_tags = [
    [1, 0, 1, 0],
    [1, 1, 1, 1],
    [0, 0, 0, 0],
    [0, 1, 0, 1]
]

In [150]:
# group_tags_frame
pd.DataFrame(group_tags, columns=groups, index=tags)

            Group-1  Group-2  Group-3  Group-4
java              1        0        0        0
javascript        1        1        1        0
mysql             1        0        0        0
dotnet            1        0        0        0

In [151]:
# user_tags_frame
pd.DataFrame(user_tags, columns=tags, index=users)

       java  javascript  mysql  dotnet
alice     1           0      1       0
john      1           1      1       1
kevin     0           0      0       0
alex      0           1      0       1

In [152]:
# dot product
pd.DataFrame(np.dot(user_tags, group_tags) / len(tags), columns=groups, index=users)

# This outcome says how many of a users tags are in a given group
# Dividing the dot product by the total amount of tags/features gives a value between 0 and 1
# Given 1 all user tags are listed in the group and given 0 none of the users tags are in the group

       Group-1  Group-2  Group-3  Group-4
alice      0.5     0.00     0.00      0.0
john       1.0     0.25     0.25      0.0
kevin      0.0     0.00     0.00      0.0
alex       0.5     0.25     0.25      0.0

In [231]:
# Using the same intuition to match users with other users

a = [sum(x) for x in user_tags]

a[2] = np.nan

pd.DataFrame(np.dot(user_tags, np.transpose(user_tags) / a), columns=users, index=users)

       alice  john  kevin  alex
alice    1.0   0.5    NaN   0.0
john     1.0   1.0    NaN   1.0
kevin    0.0   0.0    NaN   0.0
alex     0.0   0.5    NaN   1.0